jnk0le/simple-crt/cm4/stm32f4_vectors.c
	#elif defined(STM32F437xx)
		WWDG_IRQHandler,
		PVD_IRQHandler,
		TAMP_STAMP_IRQHandler,
		RTC_WKUP_IRQHandler,
		FLASH_IRQHandler,
		RCC_IRQHandler,
		EXTI0_IRQHandler,
		EXTI1_IRQHandler,
		EXTI2_IRQHandler,
		EXTI3_IRQHandler,
		EXTI4_IRQHandler,
		DMA1_Stream0_IRQHandler,
		DMA1_Stream1_IRQHandler,
		DMA1_Stream2_IRQHandler,
		DMA1_Stream3_IRQHandler,
		DMA1_Stream4_IRQHandler,
		DMA1_Stream5_IRQHandler,
		DMA1_Stream6_IRQHandler,
		ADC_IRQHandler,
		CAN1_TX_IRQHandler,
		CAN1_RX0_IRQHandler,
		CAN1_RX1_IRQHandler,
		CAN1_SCE_IRQHandler,
		EXTI9_5_IRQHandler,
		TIM1_BRK_TIM9_IRQHandler,
		TIM1_UP_TIM10_IRQHandler,
		TIM1_TRG_COM_TIM11_IRQHandler,
		TIM1_CC_IRQHandler,
		TIM2_IRQHandler,
		TIM3_IRQHandler,
		TIM4_IRQHandler,
		I2C1_EV_IRQHandler,
		I2C1_ER_IRQHandler,
		I2C2_EV_IRQHandler,
		I2C2_ER_IRQHandler,
		SPI1_IRQHandler,
		SPI2_IRQHandler,
		USART1_IRQHandler,
		USART2_IRQHandler,
		USART3_IRQHandler,
		EXTI15_10_IRQHandler,
		RTC_Alarm_IRQHandler,
		OTG_FS_WKUP_IRQHandler,
		TIM8_BRK_TIM12_IRQHandler,
		TIM8_UP_TIM13_IRQHandler,
		TIM8_TRG_COM_TIM14_IRQHandler,
		TIM8_CC_IRQHandler,
		DMA1_Stream7_IRQHandler,
		FMC_IRQHandler,
		SDIO_IRQHandler,
		TIM5_IRQHandler,
		SPI3_IRQHandler,
		UART4_IRQHandler,
		UART5_IRQHandler,
		TIM6_DAC_IRQHandler,
		TIM7_IRQHandler,
		DMA2_Stream0_IRQHandler,
		DMA2_Stream1_IRQHandler,
		DMA2_Stream2_IRQHandler,
		DMA2_Stream3_IRQHandler,
		DMA2_Stream4_IRQHandler,
		ETH_IRQHandler,
		ETH_WKUP_IRQHandler,
		CAN2_TX_IRQHandler,
		CAN2_RX0_IRQHandler,
		CAN2_RX1_IRQHandler,
		CAN2_SCE_IRQHandler,
		OTG_FS_IRQHandler,
		DMA2_Stream5_IRQHandler,
		DMA2_Stream6_IRQHandler,
		DMA2_Stream7_IRQHandler,
		USART6_IRQHandler,
		I2C3_EV_IRQHandler,
		I2C3_ER_IRQHandler,
		OTG_HS_EP1_OUT_IRQHandler,
		OTG_HS_EP1_IN_IRQHandler,
		OTG_HS_WKUP_IRQHandler,
		OTG_HS_IRQHandler,
		DCMI_IRQHandler,
		CRYP_IRQHandler,
		HASH_RNG_IRQHandler,
		FPU_IRQHandler,
		UART7_IRQHandler,
		UART8_IRQHandler,
		SPI4_IRQHandler,
		SPI5_IRQHandler,
		SPI6_IRQHandler,
		SAI1_IRQHandler,
		0,
		0,
		DMA2D_IRQHandler,

	#elif defined(STM32F439xx)
		WWDG_IRQHandler,
		PVD_IRQHandler,
		TAMP_STAMP_IRQHandler,
		RTC_WKUP_IRQHandler,
		FLASH_IRQHandler,
		RCC_IRQHandler,
		EXTI0_IRQHandler,
		EXTI1_IRQHandler,
		EXTI2_IRQHandler,
		EXTI3_IRQHandler,
		EXTI4_IRQHandler,
		DMA1_Stream0_IRQHandler,
		DMA1_Stream1_IRQHandler,
		DMA1_Stream2_IRQHandler,
		DMA1_Stream3_IRQHandler,
		DMA1_Stream4_IRQHandler,
		DMA1_Stream5_IRQHandler,
		DMA1_Stream6_IRQHandler,
		ADC_IRQHandler,
		CAN1_TX_IRQHandler,
		CAN1_RX0_IRQHandler,
		CAN1_RX1_IRQHandler,
		CAN1_SCE_IRQHandler,
		EXTI9_5_IRQHandler,
		TIM1_BRK_TIM9_IRQHandler,
		TIM1_UP_TIM10_IRQHandler,
		TIM1_TRG_COM_TIM11_IRQHandler,
		TIM1_CC_IRQHandler,
		TIM2_IRQHandler,
		TIM3_IRQHandler,
		TIM4_IRQHandler,
		I2C1_EV_IRQHandler,
		I2C1_ER_IRQHandler,
		I2C2_EV_IRQHandler,
		I2C2_ER_IRQHandler,
		SPI1_IRQHandler,
		SPI2_IRQHandler,
		USART1_IRQHandler,
		USART2_IRQHandler,
		USART3_IRQHandler,
		EXTI15_10_IRQHandler,
		RTC_Alarm_IRQHandler,
		OTG_FS_WKUP_IRQHandler,
		TIM8_BRK_TIM12_IRQHandler,
		TIM8_UP_TIM13_IRQHandler,
		TIM8_TRG_COM_TIM14_IRQHandler,
		TIM8_CC_IRQHandler,
		DMA1_Stream7_IRQHandler,
		FMC_IRQHandler,
		SDIO_IRQHandler,
		TIM5_IRQHandler,
		SPI3_IRQHandler,
		UART4_IRQHandler,
		UART5_IRQHandler,
		TIM6_DAC_IRQHandler,
		TIM7_IRQHandler,
		DMA2_Stream0_IRQHandler,
		DMA2_Stream1_IRQHandler,
		DMA2_Stream2_IRQHandler,
		DMA2_Stream3_IRQHandler,
		DMA2_Stream4_IRQHandler,
		ETH_IRQHandler,
		ETH_WKUP_IRQHandler,
		CAN2_TX_IRQHandler,
		CAN2_RX0_IRQHandler,
		CAN2_RX1_IRQHandler,
		CAN2_SCE_IRQHandler,
		OTG_FS_IRQHandler,
		DMA2_Stream5_IRQHandler,
		DMA2_Stream6_IRQHandler,
		DMA2_Stream7_IRQHandler,
		USART6_IRQHandler,
		I2C3_EV_IRQHandler,
		I2C3_ER_IRQHandler,
		OTG_HS_EP1_OUT_IRQHandler,
		OTG_HS_EP1_IN_IRQHandler,
		OTG_HS_WKUP_IRQHandler,
		OTG_HS_IRQHandler,
		DCMI_IRQHandler,
		CRYP_IRQHandler,
		HASH_RNG_IRQHandler,
		FPU_IRQHandler,
		UART7_IRQHandler,
		UART8_IRQHandler,
		SPI4_IRQHandler,
		SPI5_IRQHandler,
		SPI6_IRQHandler,
		SAI1_IRQHandler,
		LTDC_IRQHandler,
		LTDC_ER_IRQHandler,
		DMA2D_IRQHandler,

	#else
		#error "unsupported or unknown MCU"
	#endif
	};

#if !defined(__ARM_ARCH_7EM__)
	#error "wrong architecture"
#endif
